#include <avr/interrupt.h>
# define LEDS 0b00111110 // задаём пины под диоды

volatile unsigned char count = 0;
volatile unsigned char tick = 0;
void setup() {
  DDRB |= LEDS;
  DDRD &= ~(1 << PD2);
  PORTD |= (1 << PD2);
  //используем таймер1
  TCCR1A = 0;
  TCCR1B = (1 << WGM12) | (1 << CS12); //режим СТС(4 режим) и делитель 256, поэтому предыдущая строчка 0
  OCR1A = 624; // срабатывает 100 раз в сек
  TIMSK1 = (1 << OCIE1A); //прерывние при достижении значения OCR1A
  EICRA  = (1 << ISC01); // Положением "нажатие" выбран спадающий фронт кнопки PD2
  EIMSK = (1 << INT0); // разрешить прерывание INT0
  sei();
}

ISR(TIMER1_COMPA_vect) { //отсчитываем тики для того чтобы убрать дребезг с кнопки
  if (tick < 255) //условие, чтобы не было переполнения и при достижении 255 сбросится в 0 только после нажатия кнопки
    tick++;
}

ISR(INT0_vect) { //нажатие кнопки
  if (tick > 5) { //60мс задержки для предотвращения дребезга
    count++;
    tick = 0;   //запоминаем, что нажатие было
  }
}

void loop() {
  PORTB = (PORTB & ~LEDS) | ((count << 1)&LEDS); //выводим значение счётчика на диоды со смещением
}
